AnandSingh/lpc54s018-sdk/boards/lpcxpresso54s018m/emwin_examples/emwin_temperature_control/emwin_temperature_control.c
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/
static void BOARD_InitPWM(void)
{
    sctimer_config_t config;
    sctimer_pwm_signal_param_t pwmParam;
    uint32_t event;

    CLOCK_AttachClk(kMAIN_CLK_to_SCT_CLK);

    CLOCK_SetClkDiv(kCLOCK_DivSctClk, 2, true);

    SCTIMER_GetDefaultConfig(&config);

    SCTIMER_Init(SCT0, &config);

    pwmParam.output           = kSCTIMER_Out_5;
    pwmParam.level            = kSCTIMER_HighTrue;
    pwmParam.dutyCyclePercent = 5;

    SCTIMER_SetupPwm(SCT0, &pwmParam, kSCTIMER_CenterAlignedPwm, 1000U, CLOCK_GetSctClkFreq(), &event);
}

void Init_CTIMER(void)
{
    ctimer_config_t config;
    /* Enable the asynchronous bridge */
    SYSCON->ASYNCAPBCTRL = 1;

    /* Use 12 MHz clock for some of the Ctimers */
    CLOCK_AttachClk(kFRO12M_to_ASYNC_APB);

    CTIMER_GetDefaultConfig(&config);
    config.prescale = CTIMER_PRESCALE;

    CTIMER_Init(CTIMER, &config);
    CTIMER_StartTimer(CTIMER);
}


/*********************************************************************
 *
 *       _GetSelectedRoom
 *
 * Function description:
 *  This routine returns the index of of a room inside the ROOM_DATA
 *  structure.
 *
 */
static int _GetSelectedRoom(void)
{
    int i;

    for (i = 0; i < 5; i++)
    {
        if (_aRooms[i].Focus)
        {
            return i;
        }
    }
    return 0;
}

/*********************************************************************
 *
 *       _SetFanButtonState
 *
 * Function description:
 *  This routine sets the states of the fan control buttons.
 *
 */
static void _SetFanButtonState(WM_MESSAGE *pMsg, int Id)
{
    int IndexButton;
    int IndexRoom;
    int i;
    WM_HWIN hItem;

    IndexButton                     = Id - ID_BUTTON_5;
    _aButton[IndexButton].Focus     = (_aButton[IndexButton].Focus) ? 0 : 1;
    _aButton[1 - IndexButton].Focus = 0;
    for (i = 0; i < 2; i++)
    {
        WM_InvalidateWindow(WM_GetDialogItem(pMsg->hWin, _aButton[i].ID));
    }
    IndexRoom                   = _GetSelectedRoom();
    _aRooms[IndexRoom].FanState = (_aButton[IndexButton].Focus == 0) ? 0 : (IndexButton) ? 2 : 1;
    hItem                       = WM_GetDialogItem(pMsg->hWin, IndexRoom + ID_BUTTON_0);
    WM_InvalidateWindow(hItem);
}

/*********************************************************************
 *
 *       _cbButton
 *
 * Function description:
 *  This is the callback function for the buttons which represent the
 *  different rooms.
 *
 */
static void _cbButton(WM_MESSAGE *pMsg)
{
    GUI_RECT Rect;
    GUI_COLOR ColorFrame;
    GUI_COLOR Color;
    GUI_COLOR ColorText;
    GUI_CONST_STORAGE GUI_FONT *pFont23;
    GUI_CONST_STORAGE GUI_FONT *pFont32;
    int Index;
    int xSize;

    switch (pMsg->MsgId)
    {
        case WM_PAINT:
            //
            // Get index and check if it is focused or not
            //
            Index = WM_GetId(pMsg->hWin) - ID_BUTTON_0;
            if (_aRooms[Index].Focus == 1)
            { // Set colors dependend on focus state
                Color      = LIGHT_BLUE;
                ColorText  = LEMON;
                ColorFrame = GUI_WHITE;
                pFont23    = pFont23pBold;
                pFont32    = pFont32pBold;
            }
            else
            {
                Color      = DARK_BLUE;
                ColorText  = GUI_WHITE;
                ColorFrame = GUI_WHITE;
                pFont23    = pFont23p;
                pFont32    = pFont32p;
            }
            //
            // Draw thin frame around the button
            //
            WM_GetClientRectEx(pMsg->hWin, &Rect);
            GUI_SetColor(ColorFrame);
            GUI_FillRectEx(&Rect);
            GUI_SetColor(Color);
            //
            // Resize drawing rect
            //
            Rect.x0 += 1;
            Rect.x1 -= 1;
            Rect.y1 -= 1;
            //
            // Draw rest of the button
            //
            GUI_AA_FillRoundedRectEx(&Rect, 3);
            //
            // Only button 0 needs a thin gradient
            //
            if (WM_GetId(pMsg->hWin) == ID_BUTTON_0)
            {
                xSize = WM_GetWindowSizeX(pMsg->hWin);
                GUI_DrawGradientV(0, 0, xSize - 1, 4, GUI_BLACK, Color);
                GUI_DrawGradientV(0, 0, 0, 4, GUI_BLACK, ColorFrame);
                GUI_DrawGradientV(xSize - 1, 0, xSize, 4, GUI_BLACK, ColorFrame);
            }
            //
            // Draw Text
            //
            GUI_SetFont(pFont23);
            GUI_SetTextMode(GUI_TM_TRANS);
            GUI_SetColor(ColorText);
            Rect.x0 += 10;
            GUI_DispStringInRect((char *)_aRooms[Index].aName, &Rect, GUI_TA_LEFT | GUI_TA_VCENTER);
            //
            // Display fan status
            //
            GUI_SetFont(pFont23);
            GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
            GUI_GotoXY(Rect.x1 / 2 + 20, Rect.y1 / 2);
            if (_aRooms[Index].FanState == 0)
            {
                GUI_DispString("Off");
            }
            else if (_aRooms[Index].FanState == 1)
            {
                GUI_DispString("On");
            }
            else
            {
                GUI_DispString("Auto");
            }
            //
            // Display temperature with a bigger font
            //
            GUI_SetFont(pFont32);
            GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
            GUI_GotoXY(Rect.x1 - 38, Rect.y1 / 2);
            GUI_DispDecSpace(_aRooms[Index].RealTemperature, 2);
            GUI_DispString(
                "\xc2\xb0"
                "C");
            break;
        default:
            BUTTON_Callback(pMsg); // The original callback
            break;
    }
}

/*********************************************************************
 *
 *       _cbButtonFan
 */
static void _cbButtonFan(WM_MESSAGE *pMsg)
{
    GUI_RECT Rect;
    int Index;

    switch (pMsg->MsgId)
    {
        case WM_PAINT:
            WM_GetClientRectEx(pMsg->hWin, &Rect);
            if (BUTTON_IsPressed(pMsg->hWin))
            {
                GUI_DrawBitmap(&bmButtonRoundPressed_50x22, 0, 0);
            }
            else
            {
                GUI_DrawBitmap(&bmButtonRound_50x22, 0, 0);
            }
            Index = WM_GetId(pMsg->hWin) - ID_BUTTON_5;
            if (_aButton[Index].Focus == 1)
            { // Choos text color
                GUI_SetColor(LEMON);
            }
            else
            {
                GUI_SetColor(GUI_DARKGRAY);
            }
            //
            // Draw Text
            //
            GUI_SetFont(pFont23pBold);
            GUI_SetTextMode(GUI_TM_TRANS);
            GUI_DispStringInRect(_aButton[Index].aName, &Rect, GUI_TA_HCENTER | GUI_TA_VCENTER);
            break;
        default:
            BUTTON_Callback(pMsg); // The original callback
            break;
    }
}

/*********************************************************************
 *
 *       _cbKnob
 *
 * Function description:
 *   Fills the background of the KNOB with transparency
 */
static void _cbKnob(WM_MESSAGE *pMsg)
{
    switch (pMsg->MsgId)
    {
        case WM_PAINT:
            KNOB_Callback(pMsg); // The original callback
            break;
        default:
            KNOB_Callback(pMsg); // The original callback
            break;
    }
}

/*********************************************************************
 *
 *       _DrawKnob
 *
 * Function description:
 *   Fill memory device used for drawing the KNOB
 */
static void _DrawKnob(GUI_MEMDEV_Handle hMem, GUI_COLOR Color)
{
    int xSizeMem, ySizeMem;

