AnandSingh/lpc54s018-sdk/boards/lpcxpresso54s018m/emwin_examples/emwin_temperature_control/emwin_temperature_control.c
    xSizeMem = GUI_MEMDEV_GetXSize(hMem);
    ySizeMem = GUI_MEMDEV_GetYSize(hMem);
    GUI_AA_PreserveTrans(1);
    GUI_MEMDEV_Select(hMem);
    GUI_SetBkColor(GUI_TRANSPARENT);
    GUI_Clear();
    GUI_SetColor(Color);
    GUI_FillRect(xSizeMem - 16, 0, xSizeMem, ySizeMem - 1);
    GUI_SetColor(DARK_BLUE);
    GUI_DrawLine(xSizeMem - 16, ySizeMem / 2, xSizeMem, ySizeMem / 2);
    GUI_SetColor(Color);
    GUI_MEMDEV_Select(0);
    GUI_AA_PreserveTrans(0);
}

/*********************************************************************
 *
 *       _OnRelease
 */
static void _OnRelease(WM_MESSAGE *pMsg, int Id)
{
    WM_HWIN hItem, hParent;
    int Value;
    int Index;
    int i;

    Index = Id - ID_BUTTON_0;
    for (i = 0; i < 5; i++)
    {
        _aRooms[i].Focus = 0;
        if (_aRooms[i].ID != Id)
        {
            WM_InvalidateWindow(WM_GetDialogItem(pMsg->hWin, _aRooms[i].ID));
        }
    }
    hParent = pMsg->hWin;
    hItem   = WM_GetDialogItem(hParent, ID_KNOB_0);
    Value   = 2700 - ((_aRooms[Index].RealTemperature - MIN_TEMPERATURE) * 2700) / (MAX_TEMPERATURE - MIN_TEMPERATURE);
    KNOB_SetPos(hItem, Value);
    _aRooms[Index].Focus = 1;
    //
    // Check states for fan buttons
    //
    if (_aRooms[Index].FanState == 0)
    {
        _aButton[0].Focus = 0;
        _aButton[1].Focus = 0;
    }
    else if (_aRooms[Index].FanState == 1)
    {
        _aButton[0].Focus = 1;
        _aButton[1].Focus = 0;
    }
    else
    {
        _aButton[0].Focus = 0;
        _aButton[1].Focus = 1;
    }
    //
    // Tell fan buttons to redraw
    //
    for (i = 0; i < 2; i++)
    {
        WM_InvalidateWindow(WM_GetDialogItem(pMsg->hWin, _aButton[i].ID));
    }
    WM_InvalidateWindow(pMsg->hWin);
}

/*********************************************************************
 *
 *       _cbDialog
 */
static void _cbDialog(WM_MESSAGE *pMsg)
{
    static GUI_MEMDEV_Handle hMemKnob;
    static GUI_COLOR ColorKnob = GUI_WHITE;
    WM_HWIN hItem;
    WM_HWIN hParent;
    int NCode;
    int Id;
    int i;
    int Value;
    int Index;
    GUI_COLOR Color;
    GUI_RECT Rect;
    char acBuffer[8];

    switch (pMsg->MsgId)
    {
        case WM_INIT_DIALOG:
            //
            // Create KNOB
            //
            KNOB_CreateUser(307, 92, 105, 105, pMsg->hWin, WM_CF_SHOW | WM_CF_HASTRANS, ID_KNOB_0, 0);
            //
            // Create memory device for KNOB
            //
            hMemKnob = GUI_MEMDEV_CreateFixed32(0, 0, 100, 5);
            _DrawKnob(hMemKnob, ColorKnob);
            //
            // Set several KNOB properties
            //
            hItem = WM_GetDialogItem(pMsg->hWin, ID_KNOB_0);
            WM_SetCallback(hItem, _cbKnob);
            KNOB_SetDevice(hItem, hMemKnob);
            KNOB_SetRange(hItem, 0, 2700);
            KNOB_SetOffset(hItem, -KNOB_OFFSET);
            KNOB_SetPeriod(hItem, 500);
            Value =
                2700 - ((_aRooms[0].RealTemperature - MIN_TEMPERATURE) * 2700) / (MAX_TEMPERATURE - MIN_TEMPERATURE);
            KNOB_SetPos(hItem, Value);
            //
            // Initialization Buttons for each room
            //
            for (i = 0; i < 5; i++)
            {
                hItem = WM_GetDialogItem(pMsg->hWin, ID_BUTTON_0 + i);
                WM_SetCallback(hItem, _cbButton);
                _aRooms[i].ID = ID_BUTTON_0 + i;
            }
            //
            // Initialization Buttons for fan
            //
            for (i = 0; i < 2; i++)
            {
                hItem = WM_GetDialogItem(pMsg->hWin, ID_BUTTON_5 + i);
                WM_SetCallback(hItem, _cbButtonFan);
                _aButton[i].ID = ID_BUTTON_5 + i;
            }
            //
            // Init logo
            //
            hItem = WM_GetDialogItem(pMsg->hWin, ID_IMAGE_0);
            IMAGE_SetBitmap(hItem, &bmSEGGER_80x40);
            break;
        case WM_PAINT:
            Rect.x0 = 0;
            Rect.y0 = 0;
            Rect.x1 = 480;
            Rect.y1 = 272;
            GUI_SetColor(DARK_BLUE);
            GUI_FillRectEx(&Rect);

            Rect.x0 = 0;
            Rect.y0 = 24;
            Rect.x1 = 480;
            Rect.y1 = 47;
            GUI_SetColor(LIGHT_BLUE);
            GUI_FillRectEx(&Rect);

            GUI_DrawGradientV(0, 48, 480 - 1, 52, GUI_BLACK, DARK_BLUE);
            GUI_SetColor(GUI_WHITE);
            GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
            GUI_SetTextMode(GUI_TM_TRANS);
            GUI_SetFont(pFont23pBold);
            GUI_DispStringAt("Temperature control", 10, 10);

            GUI_SetFont(pFont23p);
            GUI_DispStringAt("Room:", 10, 35);
            GUI_DispStringAt("Fan state:", 101, 35);
            GUI_DispStringAt("Temp.:", 174, 35);

            Index   = _GetSelectedRoom();
            Rect.x0 = 325;
            Rect.y0 = 109;
            Rect.x1 = 394;
            Rect.y1 = 178;
            Value   = _aRooms[Index].RealTemperature;

            Index = ((Value - MIN_TEMPERATURE) * (GUI_COUNTOF(_aGradient) - 1)) / (MAX_TEMPERATURE - MIN_TEMPERATURE);
            Color = _aGradient[Index];
            GUI_SetColor(Color);
            GUI_FillRectEx(&Rect);
            sprintf(acBuffer,
                    "%i \xc2\xb0"
                    "C",
                    Value);
            GUI_SetColor(GUI_WHITE);
            GUI_DrawBitmap(&bmKNOB_124x124, 297, 82);
            GUI_DispStringInRect(acBuffer, &Rect, GUI_TA_HCENTER | GUI_TA_VCENTER);
            break;
        case WM_NOTIFY_PARENT:
            Id    = WM_GetId(pMsg->hWinSrc);
            NCode = pMsg->Data.v;
            switch (Id)
            {
                case ID_KNOB_0: // Notifications sent by 'Knob'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_VALUE_CHANGED:
                            hItem = WM_GetDialogItem(pMsg->hWin, Id);
                            Value = KNOB_GetValue(hItem);
                            //
                            // Invalidate button
                            //
                            hParent = WM_GetFirstChild(WM_GetDesktopWindowEx(0));
                            for (i = 0; i < 5; i++)
                            {
                                if (_aRooms[i].Focus == 1)
                                {
                                    hParent = WM_GetFirstChild(WM_GetDesktopWindowEx(0));
                                    _aRooms[i].RealTemperature =
                                        MAX_TEMPERATURE - Value * (MAX_TEMPERATURE - MIN_TEMPERATURE) / 2700;
                                    WM_InvalidateWindow(WM_GetDialogItem(hParent, _aRooms[i].ID));
                                    break;
                                }
                            }
                            WM_InvalidateWindow(pMsg->hWin);
                            break;
                    }
                    break;
                case ID_BUTTON_0: // Notifications sent by 'Bedroom'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _OnRelease(pMsg, Id);
                            break;
                    }
                    break;
                case ID_BUTTON_1: // Notifications sent by 'Living Room'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _OnRelease(pMsg, Id);
                            break;
                    }
                    break;
                case ID_BUTTON_2: // Notifications sent by 'Kitchen'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _OnRelease(pMsg, Id);
                            break;
                    }
                    break;
                case ID_BUTTON_3: // Notifications sent by 'Child's Room 1'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _OnRelease(pMsg, Id);
                            break;
                    }
                    break;
                case ID_BUTTON_4: // Notifications sent by 'Child's Room 2'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _OnRelease(pMsg, Id);
                            break;
                    }
                    break;
                case ID_BUTTON_5: // Notifications sent by 'On'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _SetFanButtonState(pMsg, Id);
                            break;
                    }
                    break;
                case ID_BUTTON_6: // Notifications sent by 'Auto'
                    switch (NCode)
                    {
                        case WM_NOTIFICATION_CLICKED:
                            break;
                        case WM_NOTIFICATION_RELEASED:
                            _SetFanButtonState(pMsg, Id);
                            break;
                    }
                    break;
            }
            break;
        default:
            WM_DefaultProc(pMsg);
            break;
    }
}

/*!
 * @brief Main function
 */
int main(void)
{
    /* attach 12 MHz clock to FLEXCOMM0 (debug console) */
    CLOCK_AttachClk(BOARD_DEBUG_UART_CLK_ATTACH);

    /* Route Main clock to LCD. */
    CLOCK_AttachClk(kMAIN_CLK_to_LCD_CLK);

    /* attach 12 MHz clock to FLEXCOMM2 (I2C master for touch controller) */
    CLOCK_AttachClk(kFRO12M_to_FLEXCOMM2);

    CLOCK_EnableClock(kCLOCK_Gpio2);

    CLOCK_SetClkDiv(kCLOCK_DivLcdClk, 1, true);

    BOARD_InitPins();
    BOARD_BootClockPLL180M();
    BOARD_InitDebugConsole();
    BOARD_InitSDRAM();

    /* Set the back light PWM. */
    BOARD_InitPWM();

    GUI_Init();
    WM_MULTIBUF_Enable(1);
    GUI_UC_SetEncodeUTF8();
    //
    // Create application window...
    //
    GUI_CreateDialogBox(_aDialogCreate, GUI_COUNTOF(_aDialogCreate), _cbDialog, WM_HBKWIN, 0, 0);
    //
    // ...and keep it alive
    //
    WM_Exec();

    while (1)
    {
        /* Poll touch controller for update */
        if (BOARD_Touch_Poll())
        {
            GUI_Delay(5);
        }
    }
}
